package com.dingCreator.astrology.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * @author ding
 * @date 2025/3/7
 */
@Getter
@AllArgsConstructor
public enum HerbEnum {
    HERB_1("万灵草", 1, 0, 0, 0, 1, 0),
    HERB_2("星·万化灵草", 1, 0, 0, 0, 2, 1),
    HERB_3("万炎精", 0, 1, 0, 0, 1, 0),
    HERB_4("星·万化炎灵精", 0, 1, 0, 0, 2, 1),
    HERB_5("万凌髓液", 0, 0, 1, 0, 1, 0),
    HERB_6("星·万化凌髓液", 0, 0, 1, 0, 2, 1),
    HERB_7("万毒草", 0, 0, 0, 1, 0, 0),
    HERB_8("星·万化灵毒草", 0, 0, 0, 1, 0, 1),
    HERB_9("万清根", 0, 0, 0, -1, 0, 0),
    HERB_10("星·万灵化清根", 0, 0, 0, -1, 0, 1),
    HERB_101("复灵叶", 1, 1, 0, -1, 4, 0),
    HERB_102("星·复灵晶化叶", 1, 1, 0, -1, 6, 2),
    HERB_103("火焰菇", 0, 1, 1, 1, 4, 0),
    HERB_104("星·天火灵芝", 0, 1, 1, 0, 6, 2),
    HERB_105("黄泉果", 1, 0, 1, 1, 4, 0),
    HERB_106("星·往生泉源", 1, 0, 1, 0, 6, 2),
    HERB_107("伴生灵草", 1, 1, 1, 1, 6, 0),
    HERB_108("星·比翼金銮草", 1, 1, 1, 0, 9, 2),
    HERB_109("红火草", 1, 2, 0, 2, 6, 0),
    HERB_110("星·幻火灵草", 1, 2, 0, 0, 9, 2),
    HERB_111("地炎根", 0, 3, 0, 2, 6, 0),
    HERB_112("星·地狱熔岩根", 0, 3, 0,0, 9, 2),
    HERB_113("灵补花蕊", 2, 0, 1, -2, 6, 0),
    HERB_114("星·幻灵花蕊", 2, 0, 1, -4, 9, 2),
    HERB_115("暮旦花露", 0, 0, 3, -2, 6, 0),
    HERB_116("星·朝暮淳滴", 0, 0, 3, -4, 9, 2),
    HERB_117("玄冰玉髓", 1, 0, 4, 3, 10, 0),
    HERB_118("星·太虚玄髓", 1, 0, 4, 0, 15, 2),
    HERB_119("养魂木", 4, 1, 0, -1,10, 0),
    HERB_120("星·滋神灵木", 4, 1, 0, -3, 15, 2),
    HERB_121("归息司荣菊", 2, 2, 1, -1, 10, 0),
    HERB_122("星·荣菊清液", 2, 2, 1, -3, 15, 2),
    HERB_123("长白草", 0, 0, 0, -3, 0, 0),
    HERB_124("星·长白祛毒草", 0, 0, 0, -6, 0, 2),
    HERB_201("地黄参", 3, 3, 0, 3, 18, 0),
    HERB_202("星·地黄龙参", 3, 3, 0, 0, 24, 3),
    HERB_203("天南星", 0, 3, 3, 3, 18, 0),
    HERB_204("星.天冬南星", 0, 3, 3, 0, 24, 3),
    HERB_205("雪莲精", 3, 0, 3, 2, 18, 0),
    HERB_206("星·雪莲霜粹", 3, 0, 3, 0, 24, 3),
    HERB_207("赤血藤", 4, 2, 0, 3, 18, 0),
    HERB_208("星·碧血焕青藤", 4, 2, 0, 0, 24, 3),
    HERB_209("灵斛", 2, 3, 2, -3, 21, 0),
    HERB_210("星·轩辕灵生斛", 2, 3, 2, -8, 28, 3),
    HERB_211("金血草", 3, 4, 1, 1, 24, 0),
    HERB_212("星·金鸿沥血草", 3, 4, 1, 0, 32, 3),
    HERB_213("焕生泉水", 0, 0, 0, -4, 0, 3),
    HERB_214("星·落骨化生泉", 0, 0, 0, -10, 0, 3),
    HERB_215("青冥果", 2, 5, 1, 3, 24, 0),
    HERB_216("星·青冥皇灵果", 2, 5, 1, 0, 32, 3),
    HERB_217("玉灵芝", 3, 5, 1, 3, 27, 0),
    HERB_218("星·玉蓬玄晶芝", 3, 5, 1, 0, 36, 3),
    HERB_301("紫星兰", 3, 3, 4, 4, 40, 1),
    HERB_302("星·紫云皓星兰", 3, 3, 4, 0, 50, 5),
    HERB_303("金兰仙果", 5, 8, 2, 4, 60, 1),
    HERB_304("星·金灵元核", 5, 8, 2, 0, 75, 5),
    HERB_401("太初元露", 7, 2, 7, 5, 80, 2),
    HERB_402("星·天泽露华", 7, 2, 7, 0, 96, 10),
    HERB_403("混沌龙血", 8, 8, 3, 5, 98, 2),
    HERB_404("星·天龙金皇血", 8, 8, 3, 0, 117, 10),
    HERB_405("七宝妙砂", 0, 0, 0, -6, 0, 2),
    HERB_406("星·净世砂金", 0, 0, 0, -20, 0, 10),
    HERB_1001("道品青莲", 215, 125, 210, 9, 5500, 10),
    HERB_1002("星·九十九品创世青莲", 215, 125, 210, 0, 550000, 100),
    ;
    private final String name;

    private final Integer vigor;

    private final Integer warn;

    private final Integer cold;

    private final Integer toxicity;

    private final Integer quality;

    private final Integer star;
}
